# Brewfile combined from brewfile.cli and brewfile.gui

# CLI Tools
brew "bash"
brew "git"
brew "python3"
brew "tmux"
brew "ack"
brew "wget"
brew "tree"
brew "node"
brew "nvm"
brew "bash-completion"
brew "irssi"
brew "jq"
brew "autossh"
brew "mosh"
brew "libev"
# brew install mutt
brew "go"
brew "gnu-sed"
# brew install the_silver_searcher
brew "universal-ctags"
brew "pstree"
brew "watch"
brew "fzf"
brew "fd"
brew "ripgrep"
# brew "rvm"
brew "tre"
brew "bat"
brew "dasel"
brew "git-delta"
brew "gauth"
brew "fclones"
brew "rsync" # get a modern version
brew "mole"
brew "tealdeer"
brew "vim"
brew "aider"
brew "gemini-cli"
brew "black"
brew "entr"

# opensc for that stupid card reader, then you have to change the ssh call to point
# to /usr/local/Cellar/opensc/0.13.0/lib/pkcs11/opensc-pkcs11.so
brew "opensc"

# added tools
brew "uv"
brew "ruff"
brew "btop"

# Fonts (Now part of homebrew/cask)
cask "font-cozette"
cask "font-dejavu"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-slab"
cask "font-source-code-pro"
cask "font-inconsolata"
cask "font-envy-code-r"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-code-nerd-font"

# GUI Applications (Fixed brew vs cask errors)
cask "firefox"
cask "iterm2"
cask "google-chrome"
cask "alfred"
cask "vlc"
cask "macvim-app"
cask "flux-app"
cask "vienna"
cask "caffeine"
cask "time-out"
cask "selfcontrol"
cask "lastfm"
cask "zettlr"
cask "spotify"
cask "slack"
cask "appcleaner"
# cask "dozer"
cask "macdown"
cask "onyx"
cask "witch"
cask "plex"
cask "backblaze"
cask "background-music"
cask "rocket"
cask "coteditor"
cask "monolingual"
cask "hiddenbar"
cask "radiola"
cask "musicbrainz-picard"
cask "kid3"
cask "macs-fan-control"
cask "docker-desktop"
cask "discord"
cask "karabiner-elements"
cask "raycast"
cask "kitty"
cask "espanso"
